import React from "react"
import { Link } from "react-router-dom"
import Subscribe from "../Subscribe/Subscribe"

export const CookiePolicy = () => {
  return (
    <>
      <section className="policy">
        <div className="policy__container">
          <div id="texte_a_afficher" className="texte_inselectionnable">
            <h2 className="h2 policy__h2">
              <strong className="uppercase">
                ПОЛИТИКА ИСПОЛЬЗОВАНИЯ КУКИ ФАЙЛОВ
              </strong>
              <br />
            </h2>
            <time className="date" dateTime="2021-03-25">
              Дата публикации: « 25 » Марта, 2021 г.
            </time>
            <h3 id="general-provisions" className="h3 policy__h3">
              1. ДЛЯ ЧЕГО НУЖНА ПОЛИТИКА?
            </h3>
            <p>
              <strong>1.1. Общие положения</strong>
            </p>
            <p>
              Условия настоящей Политики использования куки файлов (далее "
              <strong>Политика</strong>") распространяются на Сайт.
            </p>
            <p>
              Целью настоящей Политики является<strong> (1)</strong>{" "}
              проинформировать о перечне используемых и автоматически
              загружаемых на устройство Пользователя Файлов куки; и{" "}
              <strong>(2)</strong> уведомить о целях установки и использования
              таких Файлов куки, а также сроков их хранения/установки на
              устройстве Пользователя; и <strong>(3)</strong> информировать
              Пользователя о способах отключения Файлов куки и/или их удаления с
              устройства.
            </p>
            <p>
              Каждый Пользователь имеет право ознакомиться с текстом настоящей
              Политики по следующей ссылке:{" "}
              <span id="span_id_линк_политика">
                https://merlines.ru/cookies
              </span>
              .
            </p>
            <p>
              Если у Пользователя возникли какие-либо вопросы к настоящей
              Политике и/или к работе Файлов куки, Пользователь может адресовать
              свой вопрос Правообладателю в следующий способ:
            </p>
            <p>
              <em>
                <span id="span_id_задать_вопрос">
                  <span className="variable_vide">________</span>
                </span>
              </em>
            </p>
            <p>
              Если Пользователь не согласен и/или ему не понятны некоторые из
              условий данной Политики, он обязан немедленно прекратить
              пользование Сайтом.
            </p>
            <p>
              <strong>1.2. Определение понятий</strong>
            </p>
            <p>
              "<strong>Файлы куки</strong>" означает преимущественно небольшие
              фрагменты данных, которые хранятся на компьютере, планшете,
              мобильном телефоне или другом устройстве Пользователя и позволяют
              записывать определенную информацию при любом посещении Сайта,
              взаимодействии со службами, приложениями, инструментами, а также
              отправке и получении сообщений, с целью идентификации Пользователя
              независимо от используемого им устройства.
            </p>
            <p>
              "<strong>Пользователь</strong>" означает юридическое или
              физическое лицо, которое пользуется Сайтом и/или получило к нему
              доступ.
            </p>
            <p>
              "<strong>Правообладатель</strong>" означает следующее лицо, на имя
              которого зарегистрирован Сайт:
            </p>
            <p>
              <em>
                <span id="span_id_название_компании">
                  ООО «Транспортно-туристическая компания МерЛайнс»
                </span>
              </em>
            </p>
            <p>
              "<strong>Сайт</strong>" означает информационную единицу в
              Интернете, ресурс из веб-страниц (документов), которые объединены
              общей темой и связаны друг с другом с помощью ссылок. Сайт
              зарегистрирован на Правообладателя и обязательно привязан к
              конкретному домену, являющемуся его адресом. Настоящая Политика
              разработана для следующего сайта:{" "}
              <span id="span_id_линк_сайт">https://merlines.ru</span>.
            </p>
            <h3 id="general-provisions" className="h3 policy__h3">
              {" "}
              2. ДЛЯ ЧЕГО ИСПОЛЬЗУЮТСЯ ФАЙЛЫ КУКИ?
            </h3>
            <p>
              <strong>2.1. Цели использования</strong>
            </p>
            <p>
              Правообладатель использует Файлы куки для достижения следующих
              целей:
            </p>
            <p>
              <strong>(1)</strong> для сохранения информации о Пользователе на
              время использования им Сайта.
            </p>
            <p>
              <strong>(2)</strong> для идентификации Пользователя (распознание
              браузера и/или устройства каждый раз, когда осуществляется вход на
              Сайт, сохранение настроек экрана и браузера и/или сохранение
              логина и пароля Пользователей для входа на Сайт).
            </p>
            <p>
              <strong>(3) </strong>для размещения рекламы третьими лицами на
              Сайте и/или отслеживания ими информации о Пользователях для целей
              предоставления таргетинговой рекламы или аналитики пользования
              Сайтом.
            </p>
            <p>
              <strong>(4) </strong>для анализа посещаемости сайта
              Пользователями, выявления эффективности рекламного контента и его
              популярности среди Пользователей.
            </p>
            <p>
              <strong>(5) </strong>для работы отдельных разделов/страниц Сайта
              (где использование Файлов куки является крайне необходимым).
            </p>
            <p>
              <strong>(6) </strong>для улучшения юзабилити Сайта и навигации по
              нему.
            </p>
            <p>
              <strong>(7) </strong>для улучшения взаимодействия Сайта и
              Пользователей.
            </p>
            <p>
              <strong>(8)</strong> для повышения качества обслуживания и
              обеспечения максимального удобства и комфорта Пользователей при
              использовании Сайта.
            </p>

            <h3 id="general-provisions" className="h3 policy__h3">
              3. КАКИЕ ФАЙЛЫ КУКИ ИСПОЛЬЗУЮТСЯ?
            </h3>
            <p>
              Согласно общепринятым классификациям, на данный момент существуют
              следующие виды Файлов куки:
            </p>
            <p>
              <strong>(1)</strong> <em>Технические файлы куки</em>. Они являются
              необходимыми для бесперебойного и надежного функционирования
              Сайта. Отключение данного типа Файлов куки может привести к
              ограничению Пользователя в доступе к определенным функциональным
              возможностям Сайта.
            </p>
            <p>
              <strong>(2)</strong> <em>Сессионные файлы куки</em>. Они являются
              временными и сохраняют информацию о совершенной Пользователем
              активности в браузере в течение одной сессии (т.е. до момента
              закрытия такого браузера Пользователем).
            </p>
            <p>
              <strong>(3)</strong> <em>Перманентные файлы куки</em>. Они
              сохраняются в памяти устройства Пользователя в течение
              определенного периода времени и отвечают за личные предпочтения
              Пользователя, установленные в браузере (к примеру, языковые
              настройки браузера и/или шрифт Сайта).
            </p>
            <p>
              <strong>(4)</strong> <em>Статистические файлы куки</em>. Они нужны
              для отслеживания страниц/разделов Сайта, посещаемых Пользователем,
              а также выявления возможных ошибок в работе Сайта. Информация,
              собираемая о Пользователях данным видом Файлов куки, является
              анонимной и необходима для эффективного поддержания и обновления
              Сайта, а также для предоставления Пользователю таргетингового
              контента.
            </p>
            <p>
              <strong>(5)</strong> <em>Поведенческие файлы куки</em>. Они нужны
              для сбора информации о поисковых запросах Пользователя и его
              предпочтениях для проведения маркетинговых и/или иных рыночных
              исследований с целью последующего предоставления
              персонифицированного маркетингового и рекламного контента
              Пользователю.{" "}
            </p>
            <p>
              <strong>(6)</strong> <em>Третьи лица и их файлы куки</em>. Они
              нужны для следующих целей: <strong>(а) </strong>сбор
              аналитическими платформами информации о посещаемости Сайта
              Пользователями, формирование портрета Пользователя, а также анализ
              эффективности работы Сайта и маркетинговой стратегии; и{" "}
              <strong>(б) </strong>предоставление с помощью третьих лиц
              (маркетинговых платформ или агентств) персонализированного
              рекламного и/или маркетингового контента Пользователю на Сайте
              и/или на веб-сайтах третьих лиц.
            </p>
            <p>
              Сайт в работе использует следующие Файлы куки, принадлежащие
              Правообладателю:
            </p>
            <p>
              <em>
                <span id="span_id_перечень_файлов">
                  <span className="variable_vide">________</span>
                </span>
              </em>
              <em></em>
            </p>
            <p>
              Сайт в работе может использовать следующие Файлы куки,
              принадлежащие третьим лицам:
            </p>
            <p>
              <em>
                <span id="span_id_перечень_файлов_2">
                  <span className="variable_vide">________</span>
                </span>
              </em>
            </p>
            <h3 id="general-provisions" className="h3 policy__h3">
              4. КАК УДАЛИТЬ/ОТКЛЮЧИТЬ РАБОТУ ФАЙЛОВ КУКИ?
            </h3>
            <p>
              <strong>4.1. Общие положения</strong>
            </p>
            <p>
              При входе на Сайт Пользователь предоставляет свое согласие на
              использование Сайтом Файлов куки следующим образом:
            </p>
            <p>
              <em>
                <span id="span_id_дача_согласия">
                  <span className="variable_vide">________</span>
                </span>
              </em>
            </p>
            <p>
              Каждый Пользователь в любой момент может отключить работу Файлов
              куки на устройстве, с которого совершается вход на Сайт, и/или
              удалить уже загруженные ранее Файлы куки на устройство. Если
              Пользователь не желает отключать работу Файлов куки и/или удалять
              ранее загруженные Файлы куки, никакие дополнительные действия не
              требуются от Пользователя в данном случае.
            </p>
            <p>
              Обращаем внимание, что Правообладатель делает все возможное для
              того, чтоб использование Сайта было доступно Пользователю без
              загрузки каких-либо Файлов куки. Однако, Правообладатель не
              гарантирует, что такие Файлы куки не будут загружаться вовсе,
              ввиду технических и функциональных особенностей Сайта.
            </p>
            <p>
              Файлы куки могут храниться на устройстве Пользователя от
              нескольких часов до нескольких дней или лет, в зависимости от типа
              загруженных/используемых Файлов куки.
            </p>
            <p>
              <strong>4.2. Порядок отключения файлов куки</strong>
            </p>
            <p>
              Пользователь имеет возможность отключить работу Файлов куки на
              Сайте посредством выполнения следующих действий:
            </p>
            <p>
              <em>
                <span id="span_id_отключить_куки">
                  <span className="variable_vide">________</span>
                </span>
              </em>
            </p>
            <p>
              Пользователь также может отключить работу Файлов куки и/или
              удалить их вовсе, путем изменения настроек своего браузера (при
              этом возможно также удаление/отключение файлов куки, установленных
              другими веб-сайтами):
            </p>
            <p>
              <strong>1 </strong> Для <em>Google Chrome</em>, необходимо
              изменить параметры и конфигурацию браузера согласно следующим
              инструкциям по ссылке:
              <Link
                to="#"
                onClick={() =>
                  window.open(
                    "https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop&amp;hl=ru"
                  )
                }
              >
                {" "}
                <br />
                https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop&amp;hl=ru.
              </Link>
            </p>
            <p>
              <strong>2</strong> Для <em>Firefox</em>, необходимо изменить
              параметры и конфигурацию браузера согласно следующим инструкциям
              по ссылке:
              <Link
                to="#"
                onClick={() =>
                  window.open(
                    "https://support.mozilla.org/ru/kb/uluchshennaya-zashita-ot-otslezhivaniya-v-firefox-?redirectlocale=en-US&amp;redirectslug=enable-and-disable-cookies-website-preferences"
                  )
                }
              >
                {" "}
                <br />
                https://support.mozilla.org/ru/kb/uluchshennaya-zashita-ot-otslezhivaniya-v-firefox-?redirectlocale=en-US&amp;redirectslug=enable-and-disable-cookies-website-preferences.
              </Link>
            </p>
            <p>
              <strong>3</strong> Для <em>Internet Explorer</em>, необходимо
              изменить параметры и конфигурацию браузера согласно следующим
              инструкциям по ссылке:
              <Link
                to="#"
                onClick={() =>
                  window.open(
                    "https://support.microsoft.com/ru-ru/help/17442/windows-internet-explorer-delete-manage-cookies"
                  )
                }
              >
                {" "}
                <br />
                https://support.microsoft.com/ru-ru/help/17442/windows-internet-explorer-delete-manage-cookies.
              </Link>
            </p>
            <p>
              <strong>4</strong> Для <em>Safari</em>, необходимо изменить
              параметры и конфигурацию браузера согласно следующим инструкциям
              по ссылке:
              <Link
                to="#"
                onClick={() =>
                  window.open(
                    "https://support.apple.com/ru-ru/guide/safari/sfri11471/mac"
                  )
                }
              >
                {" "}
                <br />
                https://support.apple.com/ru-ru/guide/safari/sfri11471/mac.
              </Link>
            </p>
          </div>
        </div>
        <Subscribe />
      </section>
    </>
  )
}
